
# Data Structures in pandas

1. Series
2. DataFrame

In [3]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

# 1. Series

In [4]:
pd.Series()

Series([], dtype: float64)

In [5]:
names = ["Jay", "Kumar", "Suraj", "Divya", "Raj"]

s = pd.Series(names)
s

0      Jay
1    Kumar
2    Suraj
3    Divya
4      Raj
dtype: object

In [6]:
names

['Jay', 'Kumar', 'Suraj', 'Divya', 'Raj']

In [7]:
s[2]

'Suraj'

In [11]:
s = pd.Series(data=names, index=["a", "b", "c", "d", "e"])
s

a      Jay
b    Kumar
c    Suraj
d    Divya
e      Raj
dtype: object

In [13]:
s["c"]

'Suraj'

In [14]:
d = {
    "a":"Jay",
    "b":"Kumar",
    "c":"Suraj",
    "d":"Divya",
    "e":"Raj"
}

s = pd.Series(d)
s

a      Jay
b    Kumar
c    Suraj
d    Divya
e      Raj
dtype: object

# 2. DataFrame

In [15]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [16]:
names

['Jay', 'Kumar', 'Suraj', 'Divya', 'Raj']

In [17]:
pd.DataFrame(names)

       0
0    Jay
1  Kumar
2  Suraj
3  Divya
4    Raj

1. DataFrame
  - Name
  - Python
  - Machine Lerning

In [20]:
data = [
    ["Pratik", 89, 90],
    ["Purvesh", 78, 59],
    ["Jay", 75, 89],
    ["Sandesh", 89, 78],
    ["Raj", 89, 76]
]

colname = ["Name", "Python", "Machine Lerning"]

df = pd.DataFrame(data, columns=colname)
df

      Name  Python  Machine Lerning
0   Pratik      89               90
1  Purvesh      78               59
2      Jay      75               89
3  Sandesh      89               78
4      Raj      89               76

In [29]:
data = {
    "Name":["Pratik", "Purvesh", "Jay", "Sandesh", "Raj"],
    "Python":[89, 78, 75, 89, 89],
    "Machin Lerning": [90, 59, 89, 78, 76]
}

df = pd.DataFrame(data)
df

      Name  Python  Machin Lerning
0   Pratik      89              90
1  Purvesh      78              59
2      Jay      75              89
3  Sandesh      89              78
4      Raj      89              76

In [30]:
df.Name=="Jay"

0    False
1    False
2     True
3    False
4    False
Name: Name, dtype: bool

In [31]:
df[df.Name=="Jay"]

  Name  Python  Machin Lerning
2  Jay      75              89

In [32]:
df

      Name  Python  Machin Lerning
0   Pratik      89              90
1  Purvesh      78              59
2      Jay      75              89
3  Sandesh      89              78
4      Raj      89              76

In [33]:
data = {
    "Name":["Pratik", "Purvesh", "Jay", "Sandesh", "Raj"],
    "Python":[89, 78, 75, 89, 89],
    "Machin Lerning": [90, 59, 89, 78, 76]
}

df = pd.DataFrame(data, index=["rank1", "rank2", "rank3", "rank4", "rank5"])
df

          Name  Python  Machin Lerning
rank1   Pratik      89              90
rank2  Purvesh      78              59
rank3      Jay      75              89
rank4  Sandesh      89              78
rank5      Raj      89              76

In [34]:
np.random.randn(10,4)

array([[-0.96340173,  2.0454836 , -1.17045508, -1.38822475],
       [-0.43752278, -0.19417867, -0.11249747, -1.55916652],
       [ 1.32228147, -0.46307589,  0.4778304 ,  0.89717731],
       [-1.10744543,  0.4209085 ,  1.33992838, -0.77450977],
       [ 0.17011425,  0.36174761, -1.66158809,  0.49988533],
       [-0.75871344, -1.1356066 ,  0.70861476, -0.12653579],
       [-0.19354957, -0.47018754,  0.45821978, -0.30537019],
       [-0.63813333, -0.51026133,  1.19038275,  0.28481715],
       [-1.47077499,  0.28915991,  0.39417264, -1.31278972],
       [-0.41518263,  0.65451632,  1.23814179, -0.30086433]])

In [36]:
d = np.random.randn(10,4)
df = pd.DataFrame(d, columns=["A", "B", "C", "D"])
df

          A         B         C         D
0  2.418635  1.172057 -0.585282 -0.288343
1 -1.397642  1.560581  0.274568 -0.041438
2 -0.131697 -1.051612  0.458756 -0.170783
3 -0.845332  0.201211  0.477790  1.347373
4  2.684664 -0.942135  0.476783  1.808551
5  0.010107  0.186504 -0.393508  1.335208
6 -1.326238  0.127629  0.048208  1.447773
7  0.584366 -0.887728 -0.515507 -1.047678
8 -0.578548  0.096855 -0.039193  0.160759
9 -1.436782 -0.691011 -1.232411  1.538566

In [37]:
df.to_csv("random.csv", index=False)